# Initial WSJ Data Exploration

It seems the WSJ data only goes back to Feb 5, 1971 (and is missing some dates). We'll want to find some other data that covers from 1918 - 1971 if possible or at least 1945 - 1971 (post-WWII).

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from seaborn import set_style
set_style("whitegrid")

In [11]:
df1 = pd.read_csv('WSJ_HistoricalPrices(Jan 1, 1981 - Oct 10, 2024).csv')
df2 = pd.read_csv('WSJ_HistoricalPrices(Feb 5, 1971 - Dec 31, 1980).csv')

In [12]:
df = pd.concat([df1, df2], axis=0)
df

          Date      Open      High       Low     Close
0     10/10/24  18200.62  18333.39  18154.18  18282.05
1     10/09/24  18179.22  18302.05  18133.02  18291.62
2     10/08/24  18017.93  18203.04  17989.70  18182.92
3     10/07/24  18080.12  18096.33  17900.03  17923.90
4     10/04/24  18130.42  18145.28  17952.30  18137.85
...        ...       ...       ...       ...       ...
2495  02/11/71    101.45    101.45    101.45    101.45
2496  02/10/71    100.69    100.69    100.69    100.69
2497  02/09/71    100.76    100.76    100.76    100.76
2498  02/08/71    100.84    100.84    100.84    100.84
2499  02/05/71    100.00    100.00    100.00    100.00

[13536 rows x 5 columns]

In [14]:
# dataframe in chronological order
df_chrono = df.iloc[::-1].reset_index(drop=True)
df_chrono

           Date      Open      High       Low     Close
0      02/05/71    100.00    100.00    100.00    100.00
1      02/08/71    100.84    100.84    100.84    100.84
2      02/09/71    100.76    100.76    100.76    100.76
3      02/10/71    100.69    100.69    100.69    100.69
4      02/11/71    101.45    101.45    101.45    101.45
...         ...       ...       ...       ...       ...
13531  10/04/24  18130.42  18145.28  17952.30  18137.85
13532  10/07/24  18080.12  18096.33  17900.03  17923.90
13533  10/08/24  18017.93  18203.04  17989.70  18182.92
13534  10/09/24  18179.22  18302.05  18133.02  18291.62
13535  10/10/24  18200.62  18333.39  18154.18  18282.05

[13536 rows x 5 columns]